Repository: CofficLab/Lumi
Catalog: Packages/PluginCodeEditor/Sources/PluginCodeEditor/Resources/Localizable.xcstrings
Source language: en
Languages: zh_hans, zh_hk

source: Behavior
zh_hans: 行为
zh_hk: 行為

source: Browse projects and edit source files in a VS Code-style workspace.
zh_hans: 在类似 VS Code 的工作区中浏览项目并编辑源文件。
zh_hk: 在類似 VS Code 的工作區中瀏覽專案並編輯原始檔案。

source: Code Editor
zh_hans: 代码编辑器
zh_hk: 程式碼編輯器

source: Code Editor displays the file currently selected in the project Explorer. The Explorer remains responsible for browsing files; this plugin provides the main editing surface.
zh_hans: 代码编辑器显示项目资源管理器中当前选中的文件。资源管理器负责浏览文件；本插件提供主要的编辑界面。
zh_hk: 程式碼編輯器顯示專案資源管理器中目前選取的檔案。資源管理器負責瀏覽檔案；本插件提供主要的編輯介面。

source: Core Capabilities
zh_hans: 核心能力
zh_hk: 核心功能

source: Current File
zh_hans: 当前文件
zh_hk: 目前檔案

source: Display and edit the file currently selected in the project Explorer.
zh_hans: 显示并编辑项目资源管理器中当前选中的文件。
zh_hk: 顯示並編輯專案資源管理器中目前選取的檔案。

source: Edit and Save
zh_hans: 编辑和保存
zh_hk: 編輯與儲存

source: Edit the file directly in the main editor area.
zh_hans: 直接在主编辑区域中编辑文件。
zh_hk: 直接在主要編輯區域中編輯檔案。

source: Edit text directly in the editor and save changes with Cmd+S.
zh_hans: 直接在编辑器中修改文本，并使用 Cmd+S 保存更改。
zh_hk: 直接在編輯器中修改文字，並使用 Cmd+S 儲存變更。

source: Editing
zh_hans: 编辑
zh_hk: 編輯

source: Enable Code Editor from the plugin settings if it is disabled.
zh_hans: 如果代码编辑器已禁用，请先在插件设置中启用它。
zh_hk: 如果程式碼編輯器已停用，請先在插件設定中啟用它。

source: Experience
zh_hans: 使用体验
zh_hk: 使用體驗

source: If the selected item is not a text file, the editor shows a non-editable state.
zh_hans: 如果选中的项目不是文本文件，编辑器会显示不可编辑状态。
zh_hk: 如果選取的項目不是文字檔案，編輯器會顯示不可編輯狀態。

source: Line range
zh_hans: 行号范围
zh_hk: 行號範圍

source: Open a File
zh_hans: 打开文件
zh_hk: 開啟檔案

source: Open the Explorer rail and select a source file.
zh_hans: 打开资源管理器侧栏并选择源文件。
zh_hk: 開啟資源管理器側欄並選取原始檔案。

source: Overview
zh_hans: 概览
zh_hk: 概覽

source: Press Cmd+S to save the current file.
zh_hans: 按下 Cmd+S 保存当前文件。
zh_hk: 按下 Cmd+S 儲存目前檔案。

source: Save
zh_hans: 保存
zh_hk: 儲存

source: Select Code Editor in the Activity Bar.
zh_hans: 在活动栏中选择代码编辑器。
zh_hk: 在活動列中選取程式碼編輯器。

source: Selected code
zh_hans: 选中的代码
zh_hk: 選取的程式碼

source: Send to Conversation
zh_hans: 发送到对话
zh_hk: 傳送至對話

source: Syntax Highlighting
zh_hans: 语法高亮
zh_hk: 語法高亮

source: Syntax highlighting is provided by the shared Editor Host.
zh_hans: 语法高亮由共享编辑器宿主提供。
zh_hk: 語法高亮由共用編輯器主機提供。

source: The current file comes from ProjectProviding. When another plugin changes the current file, Code Editor receives the change and refreshes its content automatically.
zh_hans: 当前文件来自 ProjectProviding。当其他插件更改当前文件时，代码编辑器会接收更改并自动刷新内容。
zh_hk: 目前檔案來自 ProjectProviding。當其他插件變更目前檔案時，程式碼編輯器會接收變更並自動重新整理內容。

source: The editor automatically loads and displays the selected file.
zh_hans: 编辑器会自动加载并显示选中的文件。
zh_hk: 編輯器會自動載入並顯示選取的檔案。

source: The editor follows the file selected in the project Explorer.
zh_hans: 编辑器会跟随项目资源管理器中选中的文件。
zh_hk: 編輯器會跟隨專案資源管理器中選取的檔案。

source: The shared editor surface detects the file language and highlights source code.
zh_hans: 共享编辑器表面会识别文件语言并为源代码添加高亮。
zh_hk: 共用編輯器表面會識別檔案語言並為原始碼加上高亮。

source: User Manual
zh_hans: 用户手册
zh_hk: 使用手冊
